#+TITLE: Assignment 1 Array
#+AUTHOR: Guowei Lv
#+LATEX_CLASS: article
#+LaTeX_HEADER: \usemintedstyle{emacs}

** Compile and Build
Extract all the source code into files and compile and build the executable.
#+BEGIN_SRC emacs-lisp :exports none
;; tangle the source code
(org-babel-tangle)
;; export to pdf
(org-latex-export-to-pdf)
;; build
(shell-command-to-string "make")
#+END_SRC

#+RESULTS:
: g++ -c -std=c++11 Array.cpp -o Array.o
: g++ -std=c++11 main.cpp Array.o -o main.o

** Clean
Keeps only the org file.
#+begin_src emacs-lisp :exports none
(shell-command-to-string "make clean")
#+end_src

#+RESULTS:
: rm -rf *.o *.tex *.cpp *.h *.inl makefile _minted-assignment1

